app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "comments" ("name", "comment", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "fgfg"], ["comment", "ghhgh"], ["post_id", 4], ["created_at", "2020-03-14 18:02:11.804504"], ["updated_at", "2020-03-14 18:02:11.804504"]]
INSERT INTO "comments" ("name", "comment", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "new"], ["comment", ""], ["post_id", 3], ["user_id", 3], ["created_at", "2020-03-22 08:52:44.385624"], ["updated_at", "2020-03-22 08:52:44.385624"]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(params[:comment].permit(:name, :comment))
    @comment.user = current_user
    @comment.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."post_id" = ? AND "comments"."id" = ? LIMIT ?  [["post_id", 1], ["id", 1], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
---
  def destroy
    @post = Post.find(params[:post_id])
    @comment = @post.comments.find(params[:id])

    if @comment.user == current_user
      @comment.destroy