app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "rails_5"], ["description", "ad"], ["user_id", 1], ["created_at", "2020-03-15 09:57:37.582003"], ["updated_at", "2020-03-15 09:57:37.582003"]]
---
  def create
    @post = Post.new(post_params)

    @post.user = current_user
    respond_to do |format|
      if @post.save

UPDATE "posts" SET "updated_at" = ? WHERE "posts"."id" = ?  [["updated_at", "2020-03-14 10:11:46.795649"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]
---
  def destroy
    if @post.user == current_user
      @post.destroy